       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       AUTHOR. Lélia.

       PROCEDURE DIVISION.

           DISPLAY 'HELLO WORLD'.

           STOP RUN.
