       IDENTIFICATION DIVISION.
       PROGRAM-ID. Multiplication.
       AUTHOR. Lélia.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  WS-COMPTEUR PIC 9(2).
       01  WS-RESULTAT PIC 9(3).

       PROCEDURE DIVISION.

       PERFORM VARYING WS-COMPTEUR FROM 1 BY 1 UNTIL WS-COMPTEUR > 10
           COMPUTE WS-RESULTAT = 3 * WS-COMPTEUR
           DISPLAY "3 x " WS-COMPTEUR " = " WS-RESULTAT
       END-PERFORM.

           STOP RUN.
